---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStandardStairTopEndExceedsOrNotReach
source: html/9c98003f-e71b-5557-736c-ef5e55d72498.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStandardStairTopEndExceedsOrNotReach Property

One of the stairs inside multistory stairs top ends exceed or cannot reach the top elevation of the stair.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryStandardStairTopEndExceedsOrNotReach { get; }
```